[
  {
    "Title": "Tell me about a time when you didn't have enough data to make the right decision. What did you do? What path did you take? Did the decision turn out to be the correct one?",
    "Principle": "Right a lot",
    "Ans1": "DRDO",
    "Ans2": "Joyride - IAP - Subscription"
  },
  {
    "Title": "Tell me about a strategic decision you had to make without clear data or benchmarks. How did you make your final decision? What alternatives did you consider? What were the tradeoffs of each? How did you mitigate risk?",
    "Principle": "Right a lot",
    "Ans1": "Joyride - opentok + RED",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you made a difficult decision with input from many different sources (customers, stakeholders, partner teams, etc.). What was the situation and how did you arrive at your decision? Did the decision turn out to be the correct one? Why or why not?",
    "Principle": "Right a lot",
    "Ans1": "Joyride - IAP - Subscription",
    "Ans2": ""
  },
  {
    "Title": "We don't always make the right decision all the time. Tell me about a time when you made a bad decision. What was the impact of that decision? What did you learn? How have you applied what you learned?",
    "Principle": "Right a lot",
    "Ans1": "Joyride  - weekly subscriptions",
    "Ans2": ""
  },
  {
    "Title": "We don't always make the right judgment all the time. Tell me about a time when you made an error in judgment. What was the impact? What did you learn? How have you applied what you learned?",
    "Principle": "Right a lot",
    "Ans1": "Joyride  - weekly subscriptions",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you discovered that your idea was not the best course of action. What was your idea? Why wasn't your idea the best course of action? How did you find out it was not the correct path? What was the best course of action? Who provided it? What did you learn from the experience?",
    "Principle": "Right a lot",
    "Ans1": "games24x7 AIDL vs HAck - unity",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you brought different perspectives together to solve a problem. What types of different perspectives were represented? How did you seek out different points of view? What was the outcome? Where there any key learnings from this experience? Knowing what you know now, would you have done anything different?",
    "Principle": "Right a lot",
    "Ans1": "Kiwi - bug -testing",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a calculated risk that you have taken where speed was critical. What was the situation and how did you handle it? What steps did you take to mitigate the risk? What was the outcome? Knowing what you know now, would you have done anything differently?",
    "Principle": "Bias for action",
    "Ans1": "games24x7 AIDL vs HAck - unity",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you worked against tight deadlines and didn't have time to consider all options before making a decision. How much time did you have? What approach did you take? What did you learn from the situation?",
    "Principle": "Bias for action",
    "Ans1": "Joyride - opentok + RED",
    "Ans2": ""
  },
  {
    "Title": "Describe a situation where you made an important business decision without consulting your manager. What was the situation and how did it turn out? Would you have done anything differently?",
    "Principle": "Bias for action",
    "Ans1": "??",
    "Ans2": "convertkit"
  },
  {
    "Title": "Tell me about a time when you had to gather information and respond immediately to a situation. What was the outcome? Would you have done anything differently?",
    "Principle": "Bias for action",
    "Ans1": "Kiwi - bug -testing",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of when you had to make an important decision and had to decide between moving forward or gathering more information. What did you do? What was the outcome? What information is necessary for you to have before acting?",
    "Principle": "Bias for action",
    "Ans1": "Joyride - opentok + RED",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you saw an issue that would impact your team and took a proactive approach to solve it. What was the issue? What did you do and what was the outcome? What did you learn from this situation?",
    "Principle": "Bias for action",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you felt your team was not moving to action quickly enough. What was the situation? What did you do? What was the outcome? Would you have done anything differently? (Manager)",
    "Principle": "Bias for action",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you were able to remove a serious roadblock/barrier preventing your team from making progress. What was the barrier? How were you able to remove it? What was the outcome? Knowing what you know now, would you have done anything differently? (Manager)",
    "Principle": "Bias for action",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Describe a difficult interaction you had with a customer. How did you deal with it? What was the outcome? How would you handle it differently?",
    "Principle": "Customer Obsession",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "School Payment"
  },
  {
    "Title": "Tell me about a time when you went above and beyond for a customer. Why did you do it? How did the customer respond? What was the outcome?",
    "Principle": "Customer Obsession",
    "Ans1": "Github- Carousel",
    "Ans2": "Respire Email - Ari"
  },
  {
    "Title": "Give me an example of when you were able to anticipate a customer need with a solution/product they didn't know they needed/wanted yet. How did you know they needed this? How did they respond?",
    "Principle": "Customer Obsession",
    "Ans1": "Github- Carousel",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a time when you asked for customer feedback. How did you use that feedback to drive innovation or improvement? How did the customer respond?",
    "Principle": "Customer Obsession",
    "Ans1": "Respire Email - Ari",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you evaluated the customer experience of your product or service. What did you do? What was the result?",
    "Principle": "Customer Obsession",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when a customer came to you for something that wouldn't actually address their need. How did you approach the situation? What was the result?",
    "Principle": "Customer Obsession",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "Joyride unit test skip"
  },
  {
    "Title": "Sometimes customers make unreasonable requests. Tell me about a time when you've had to push back or say no to a customer request. What did you say or do in response to that request?",
    "Principle": "Customer Obsession",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had to balance the needs of the customer with the needs of the business. What did you do? What was the result?",
    "Principle": "Customer Obsession",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a change you implemented in your current team or organization to meet the needs of your customers. What has been the result? (Manager)",
    "Principle": "Deliver Results",
    "Ans1": "Kiwi - bug -testing",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a time when you were able to deliver an important project under a tight deadline. What sacrifices did you have to make to meet the deadline? How did they impact the final deliverable? What was the final outcome?",
    "Principle": "Deliver Results",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had significant, unanticipated obstacles to overcome in achieving a key goal. What was the obstacle? Were you eventually successful? Knowing what you know now, is there anything you would have done differently?",
    "Principle": "Deliver Results",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you not only met a goal but considerably exceeded expectations. How were you able to do it? What challenges did you have to overcome?",
    "Principle": "Deliver Results",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": "UPI Payment - Games24x7"
  },
  {
    "Title": "Tell me about a time when you or your team were more than half way to meeting a goal when you realized it may not be the right goal or may have unintended consequences. What was the situation? What did you do? What was the outcome? Looking back, would you have done anything differently?",
    "Principle": "Deliver Results",
    "Ans1": "NAE + OEMS",
    "Ans2": "Joyride - opentok + RED"
  },
  {
    "Title": "Give me an example of a mission or goal you didn’t think was achievable. What was it and how did you help your team try to achieve it? Were you successful in the end? Looking back, would you have done anything differently?",
    "Principle": "Deliver Results",
    "Ans1": "Joyride - opentok + RED",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you did not effectively manage your projects and something did not get completed on time. What was the impact? What approaches do you use to make sure you are focusing on the right deliverables when you have several competing priorities?",
    "Principle": "Deliver Results",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "It can be difficult to set goals for a team that are challenging, yet achievable. Tell me about a time when you hit the right balance. How did you approach setting the goals? What was the outcome? (Manager)",
    "Principle": "Deliver Results",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you were trying to understand a complex problem on your team and you had to dig into the details to figure it out. Who did you talk with or where did you have to look to find the most valuable information? How did you use that information to help solve the problem?",
    "Principle": "Dive Deep",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a situation that required you to dig deep to get to the root cause. How did you know you were focusing on the right things? What was the outcome? Would you have done anything differently?",
    "Principle": "Dive Deep",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a problem you had to solve that required in-depth thought and analysis. How did you know you were focusing on the right things? What was the outcome? Would you have done anything differently?",
    "Principle": "Dive Deep",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": ""
  },
  {
    "Title": "Walk me through a big problem or issue in your organization that you helped to solve. How did you become aware of it? What information did you gather? What information was missing and how did you fill the gaps? Did you do a reflection at the conclusion of the project? If so, what did you learn?",
    "Principle": "Dive Deep",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  },
  {
    "Title": "Tell me about a specific metric you have used to identify a need for a change in your department. Did you create the metric or was it already available? How did this and other information influence the change? What was the outcome of this change?",
    "Principle": "Dive Deep",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Have you ever created a metric that helped identify a need for a change in your department? What was the metric? Why did you create it? How did this and other information influence change? What was the outcome of the change?",
    "Principle": "Dive Deep",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had to validate the assumptions underlying a direct report's project. How did you decide follow up was necessary? What steps, if any, did you take to validate the assumptions? What was the result? (Manager)",
    "Principle": "Dive Deep",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had to communicate a change in direction that you anticipated people would have concerns with. What did you do to understand the concerns and mitigate them? Were there any changes you made along the way after hearing these concerns? How did you handle questions and/or resistance? Were you able to get people comfortable with the change?",
    "Principle": "Earn Trust",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a tough or critical piece of feedback you received. What was it and what did you do about it?",
    "Principle": "Earn Trust",
    "Ans1": "Respire Pricing",
    "Ans2": "ERD Structure"
  },
  {
    "Title": "Describe a time when you needed to influence a peer who had a differing opinion about a shared goal. What did you do? What was the outcome?",
    "Principle": "Earn Trust",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a time when you were not able to meet a commitment. What was the commitment and what were the obstacles that prevented success? What was the impact to your customers/peers and what did you learn from it?",
    "Principle": "Earn Trust",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "24x7 code refactor - Permission + Unity  + rx"
  },
  {
    "Title": "Tell me about a time when your team’s goals were out of alignment with another team you relied on in order to meet your goal. How did you work with the other team? Were you able to achieve your goals?",
    "Principle": "Earn Trust",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you uncovered a significant problem in your team. What was it and how did you communicate it to your manager and other stakeholders? What did you do to address the problem? How did you manage the impact of this problem for the rest of your team?",
    "Principle": "Earn Trust",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you improved morale and productivity on your team. What were the underlying problems and their causes? How did you prevent them from negatively impacting the team in the future?",
    "Principle": "Earn Trust",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when a team member was struggling to keep up or fit in and you stepped in to help out. Why did you think they were struggling or not fitting in? Why did you decide in step in and support? What did you do to help out? How did it impact your work? What was the outcome? What did you learn from that situation?",
    "Principle": "Earn Trust",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of how you have helped save costs or eliminate waste within your role or organization. What was the situation? What was the impact?",
    "Principle": "Frugality",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you had to get a project or initiative completed with limited resources. How did you approach the situation? What was the impact? Knowing what you know now, would you have done anything differently?",
    "Principle": "Frugality",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": "UPI Payment - Games24x7"
  },
  {
    "Title": "Tell me about a time when you didn’t have enough resources to do something you felt was important but found a creative way to get it done anyway. What was the situation? What other options did you consider? How did you decide on a path forward? What was the outcome?",
    "Principle": "Frugality",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had to make tradeoffs between quality and cost. How did you weigh the options? What was the result? Would you have done anything differently?",
    "Principle": "Frugality",
    "Ans1": "Joyride unit test skip",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you generated a creative solution to a problem or project without requiring additional resources. What was the problem? What was the solution and how did you come up with it? What was the outcome?",
    "Principle": "Frugality",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Give an example of a time you requested additional funding/budget to complete a project. Why was it needed? Did you try to figure out another approach? Did you get the additional resources? Why or why not?",
    "Principle": "Frugality",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you had to decide whether or not to award or ask for additional resources. What criteria do you use for making the call? What was the outcome? Knowing what you know now, would you have done anything differently? (Manager)",
    "Principle": "Have Backbone",
    "Ans1": "Huawei Support",
    "Ans2": "A/B test - Profile image"
  },
  {
    "Title": "Give an example of a time when you challenged your team to come up with a more efficient solution or process. What drove the request? How did you help? What were some of your biggest challenges? What were the end results? (Manager)",
    "Principle": "Have Backbone",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you strongly disagreed with your manager or peer on something you considered very important to the business. What was it and how did you handle it? Knowing what you know now, would you do anything differently?",
    "Principle": "Have Backbone",
    "Ans1": "Huawei Support",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you took an unpopular stance in a meeting with peers and your leader. What was it? Why did you feel strongly about it? What did you do? What was the outcome?",
    "Principle": "Have Backbone",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Often, we must make decisions as a group. Give me an example of a time you committed to a group decision even though you disagreed. What factors led you to commit to the decision? Would you make the same decision now?",
    "Principle": "Have Backbone",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you felt really strongly about something on a project but the team decided to go in a different direction. How hard did you press the issue? How did you approach that project afterward?",
    "Principle": "Have Backbone",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you pushed back against a decision that negatively impacted your team. What was the issue? How did it turn out? Would you have done anything differently?",
    "Principle": "Have Backbone",
    "Ans1": "A/B test - Profile image",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of when you submitted a great idea to your manager and they did not support it. What was the idea? How did you handle the lack of support?",
    "Principle": "Have Backbone",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you had to support a business initiative that you didn't agree with. How did you handle it? How did you deliver the message to your team?",
    "Principle": "Have Backbone",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when the business gained something because you persisted for a length of time. Why were you so determined? How did it turn out?",
    "Principle": "Have Backbone",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you helped one of your team members develop their career. How did you help that team member? What was the result?",
    "Principle": "Hire and Nurture",
    "Ans1": "KL",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you invested in an employee's development. What did you invest in and why? What was the outcome? Can you share an example where investing in an employee's development didn't work out?",
    "Principle": "Hire and Nurture",
    "Ans1": "KL",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you refused to compromise your standards around quality/customer service, etc. Who was your customer? What was the result?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you were unsatisfied with the status quo. What did you do to change it? What was the impact? Would you do anything differently in the future?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you worked to improve the quality of a product / service / solution that was already getting good customer feedback. Why did you think it needed improvement? How did customers react?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": "24x7 code refactor - Permission + Unity  + rx"
  },
  {
    "Title": "Tell me about a time when you had to make a decision between standards and delivery. What tradeoffs did you have make? What was the outcome? Knowing what you know now, would you have done anything differently?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a goal you’ve had where you wish you had done better. What was the goal? How could you have improved on it?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": "DRDO"
  },
  {
    "Title": "Describe the most significant continuous improvement project that you led. What was the catalyst to this change and how did you go about it? What was the outcome?",
    "Principle": "Insist on Highest Standards",
    "Ans1": "Joyride - IAP - Subscription",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you used feedback about your team to drive a change. How did you gather or receive feedback on your team's performance? What was the outcome? (Manager)",
    "Principle": "Insist on Highest Standards",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of a complex problem you solved with a simple solution. What made the problem complex? How do you know your solution addressed the problem?",
    "Principle": "Invent|Simplify",
    "Ans1": "DRDO",
    "Ans2": ""
  },
  {
    "Title": "Describe the most innovative thing you’ve done and why you thought it was innovative. Ask for one or two more examples to see if it's a pattern of innovative thinking. What was the problem it was solving? What was innovative about it?",
    "Principle": "Invent|Simplify",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": "Documentation coverage - KT Sessions (Covid Onboarding)"
  },
  {
    "Title": "Tell me about a time when you were able to make something simpler for customers. What drove you to implement this change? What was the impact?",
    "Principle": "Invent|Simplify",
    "Ans1": "Respire Email - Ari",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you influenced and drove new thinking and innovation out of your team. Give an example of how your approach led to a specific innovation.",
    "Principle": "Invent|Simplify",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you had a challenging problem or situation that the usual approach wouldn't address. How did you select an alternative approach? What alternative approach(es) did you consider? What was the end result? What was the impact?",
    "Principle": "Invent|Simplify",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": "DRDO"
  },
  {
    "Title": "Tell me about a novel idea you had or decision you made that had a big impact on your business. What was novel about it?",
    "Principle": "Invent|Simplify",
    "Ans1": "Joyride - IAP - Subscription",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you realized you needed a deeper level of subject matter expertise to do your job well. What did you do about it? What was the outcome? Is there anything you would have done differently?",
    "Principle": "Learn | curious",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "Joyride - opentok + RED"
  },
  {
    "Title": "Describe a time when you took on work outside of your comfort area. How did you identify what you needed to learn to be successful? How did you go about building expertise to meet your goal? Did you meet your goal?",
    "Principle": "Learn | curious",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you didn’t know what to do next or how to solve a challenging problem. How do you learn what you don't know? What were the options you considered? How did you decide the best path forward? What was the outcome?",
    "Principle": "Learn | curious",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "We all have things about ourselves we'd like to improve on at work. Give me an example of something that you've worked on to improve your overall work effectiveness. What resources did you identify to help you develop? What was the impact?",
    "Principle": "Learn | curious",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  },
  {
    "Title": "Give me an example of a time when you explored a new or unexpected area of an existing space. Why hadn't this been explored already? Why did you move forward? What were the results or what was the impact?",
    "Principle": "Learn | curious",
    "Ans1": "DRDO",
    "Ans2": "Gueshouser - Image - Gzip"
  },
  {
    "Title": "Describe a time when someone on your team challenged you to think differently about a problem. What was the situation? How did you respond? What was the outcome?",
    "Principle": "Learn | curious",
    "Ans1": "Joyride - opentok + RED",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you used external trends to improve your own company's products or services. How did you keep up to date with external trends? How did you decide to apply them to your own company? What was the result?",
    "Principle": "Learn | curious",
    "Ans1": "Gueshouser - Image - Gzip",
    "Ans2": "UPI Payment - Games24x7"
  },
  {
    "Title": "Tell me about a time when you took on something significant outside your area of responsibility. Why was it important? What was the outcome?",
    "Principle": "Ownership",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  },
  {
    "Title": "Describe a time when you didn't think you were going to meet a commitment you promised. How did you identify the risk and communicate it to stakeholders? Is there anything you would do differently?",
    "Principle": "Ownership",
    "Ans1": "UPI Payment - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of an initiative you undertook because you saw that it could benefit the whole company or your customers, but wasn’t within any group’s individual responsibility so nothing was being done.",
    "Principle": "Ownership",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you made a hard decision to sacrifice short term gain for something that would create long term value for the business. What was the outcome? Knowing what you know now, would you have done anything differently?",
    "Principle": "Ownership",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Describe a time when you had to transition a project you owned to a new owner. What steps did you take to make sure the transition went smoothly? Tell me about a time that you chose to get involved in a project that you had already transitioned to somebody else. What was the situation? Why was it important to get involved?",
    "Principle": "Ownership",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": ""
  },
  {
    "Title": "Tell me about time when you were working on an initiative or goal and saw an opportunity to do something much bigger or better than the initial focus. Did you take that opportunity? Why or why not? What was the outcome?",
    "Principle": "Ownership",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Give me an example of how you have changed the direction or view of a specific function/department and helped them embrace a new way of thinking. Why was a change needed? What was the outcome?",
    "Principle": "Think Big",
    "Ans1": "Joyride - IAP - Subscription",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  },
  {
    "Title": "Give me an example of a time you proposed a novel approach to a problem. What was the problem and why did it require a novel approach? Was your approach successful?",
    "Principle": "Think Big",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": "24x7 code refactor - Permission + Unity  + rx"
  },
  {
    "Title": "Tell me about a time when you drove adoption for your vision/ideas. How did you know your vision/idea was adopted by others? How did you drive adoption for your vision/ideas? How did you track adoption? Would you do anything differently?",
    "Principle": "Think Big",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  },
  {
    "Title": "Give me an example of an idea or vision you had which was adopted by global stakeholders. How did you drive adoption for your vision/ideas? How did you track adoption? Would you do anything differently?",
    "Principle": "Think Big",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": "Gueshouser - Image - Gzip"
  },
  {
    "Title": "Tell me about a time when you thought differently to improve a process that was working. What assumptions did you have to question? How did you evaluate if the change improved the process? Knowing what you know now, would you do anything differently?",
    "Principle": "Think Big",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you encouraged a team member or organization to take a big risk. How did you balance the risk against existing business goals? What was the outcome? What did you learn from this situation? (Manager)",
    "Principle": "Think Big",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me a time when you helped build a more inclusive working environment. What problems were you trying to address? What did you do? What were the employees’ reactions? How did the changes help the employees?",
    "Principle": "Earth best Employer",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you advocated for someone who had less influence or seniority than you. How or why did you advocate for them and what was the outcome?",
    "Principle": "Earth best Employer",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": "Kiwi - bug -testing"
  },
  {
    "Title": "Describe a time when you implemented a change at work aimed at improving the work experience of yourself or coworkers. What was the goal? Why did you feel this change was necessary? What was the outcome?",
    "Principle": "Earth best Employer",
    "Ans1": "Ci/CD - Jenkins - Games24x7",
    "Ans2": "Documentation coverage - KT Sessions (Covid Onboarding)"
  },
  {
    "Title": "Describe a time when you promoted diversity, equity, or inclusion in the workplace. What forms of diversity did you consider (e.g., gender, ethnicity, personal interests)? What approach did you use?",
    "Principle": "Earth best Employer",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you showed compassion toward someone during a stressful or high-pressure situation. How did you recognize that it was important to demonstrate sensitivity? What did you do to demonstrate compassion? What were the outcomes for that person and the situation?",
    "Principle": "Earth best Employer",
    "Ans1": "Sir Culture",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you supported or empowered someone else on your team to achieve a professional or personal goal. What was your role in the situation? How did it impact you?",
    "Principle": "Earth best Employer",
    "Ans1": "KL",
    "Ans2": "Documentation coverage - KT Sessions (Covid Onboarding)"
  },
  {
    "Title": "Give me an example of a time when you organized or participated in an initiative to foster an enjoyable work environment. What was the activity or initiative? What did you do? How did other employees react?",
    "Principle": "Earth best Employer",
    "Ans1": "Documentation coverage - KT Sessions (Covid Onboarding)",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you noticed someone was being excluded or treated unfairly. Were you able to do anything to help?",
    "Principle": "Earth best Employer",
    "Ans1": "Kiwi - bug -testing",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time you worked on a project that had impact beyond your immediate client/customer/organization. How did you approach the potential downstream impact of this work? When in the course of the project did you start thinking about this impact, and what efforts did you make to manage this impact? What were the risks?",
    "Principle": "Broad Responsibility",
    "Ans1": "DRDO",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you decided to change a decision because of unintended consequences for your customers. What was the impact to your customers? What tradeoffs did you have to make? How did your new solution better serve your customers?",
    "Principle": "Broad Responsibility",
    "Ans1": "Joyride  - weekly subscriptions",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time when you changed course because of the negative impact you were going to cause to a third-party.",
    "Principle": "Broad Responsibility",
    "Ans1": "Joyride  - weekly subscriptions",
    "Ans2": ""
  },
  {
    "Title": "Tell me a time when you thought carefully about social responsibility as a critical aspect of your decision making. Why was social responsibility important? How did it (i.e., considering social responsibility) have impact on the decision-making process?",
    "Principle": "Broad Responsibility",
    "Ans1": "Respire Email - Ari",
    "Ans2": "Github- Carousel"
  },
  {
    "Title": "Tell me about a time when you considered everyone who was affected by your work, not just your direct customers or people within your organization.",
    "Principle": "Broad Responsibility",
    "Ans1": "Github- Carousel",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time where you realized a project you were working on would have unintended, and perhaps undesired, consequences in the future. Can you tell me about a time when you didn’t realize the unintended consequences until the project was complete?",
    "Principle": "Broad Responsibility",
    "Ans1": "Joyride  - weekly subscriptions",
    "Ans2": ""
  },
  {
    "Title": "Tell me about a time you left something better than how you found it. What was it and how did you change or impact it? How did your actions influence things for the better?",
    "Principle": "Broad Responsibility",
    "Ans1": "24x7 code refactor - Permission + Unity  + rx",
    "Ans2": "Ci/CD - Jenkins - Games24x7"
  }
]